InformationRegisters/ИдентификаторыОбъектовWikki.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИдентификаторыОбъектовWikki</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПолучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сайт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СайтыWikki</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаБанковскойКартой</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИдентификаторыОбъектовWikki/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Запись.Идентификатор = СокрЛП(Запись.Идентификатор);
	
	// проверяем уникальность ИД на случай если пользователь меняет запись руками	 
	ЗаписиСТакимиИД = ИдентификаторУникален(Запись.Идентификатор, Запись.Сайт, Запись.Объект, Запись.ИсходныйКлючЗаписи);
	Если ЗаписиСТакимиИД.Количество() > 0 Тогда
		Отказ = Истина;
		ПараметрыФормы = Новый Структура("ДанныеЗаписей", ЗаписиСТакимиИД);
		ОткрытьФорму("РегистрСведений.ИдентификаторыОбъектовWikki.Форма.ФормаДублей", ПараметрыФормы, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИдентификаторУникален(Идентификатор, Сайт, Объект, ИсходныйКлючЗаписи)
	
	Результат = Новый Массив;
	
	ТекущаяЗапись = РегистрыСведений.ИдентификаторыОбъектовWikki.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(ТекущаяЗапись, ИсходныйКлючЗаписи);
	ТекущаяЗапись.Прочитать();
	ЭтоНовый = НЕ ТекущаяЗапись.Выбран();

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИдентификаторыОбъектовWikki.Сайт КАК Сайт,
	|	ИдентификаторыОбъектовWikki.Объект КАК Объект,
	|	ИдентификаторыОбъектовWikki.Идентификатор КАК Идентификатор
	|ИЗ
	|	РегистрСведений.ИдентификаторыОбъектовWikki КАК ИдентификаторыОбъектовWikki
	|ГДЕ
	|	ИдентификаторыОбъектовWikki.Сайт = &Сайт
	|	И ИдентификаторыОбъектовWikki.Идентификатор = &Идентификатор
	|	И НЕ ИдентификаторыОбъектовWikki.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Сайт", Сайт);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		// если меняется текущая запись
		Если НЕ ЭтоНовый
			И Выборка.Сайт = ТекущаяЗапись.Сайт
			И Выборка.Идентификатор = ТекущаяЗапись.Идентификатор
			И Выборка.Объект = ТекущаяЗапись.Объект Тогда
			Продолжить;
		КонецЕсли;
		
		Результат.Добавить(Новый Структура("Сайт, Идентификатор, Объект", Выборка.Сайт, Выборка.Идентификатор, Выборка.Объект));		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
